{-# OPTIONS --no-unicode #-}

module Lib.One where

-- типът данни с една стойност в него
-- това следва от факта че One е запис, комбинирано с факта че има 0 полета
--
-- за да създадем стойност от тип запис, трябва да дадем стойности за всичките му полета
-- което е много лесно - има само един начин да дадем стойности на 0 неща, който изисква от нас да дадем 0 стойности
--
-- изразява "тривиална истина" и най-често се използва когато искаме да изразим че нещо е "тривиално доказуемо"
record One : Set where
  constructor <>
